{
  "conventions": [
    {
      "id": "5OrMryy209A9vq3kaZpK",
      "data": {
        "name": "Splinter Bids",
        "text": "•\tDefinition: A splinter bid is a double-jump bid in a new suit that shows:\n\t•\tSupport for partner’s suit (at least 4 cards).\n\t•\tA singleton or void in the bid suit.\n\t•\tGame-going strength (typically 10-14 HCP for responder or 15-18 HCP for opener) .\n\t•\tPurpose:\n\t•\tTo communicate shortness in a specific suit and strong support for partner’s suit.\n\t•\tTo help the partnership evaluate slam potential by identifying wasted values in the short suit .\n\t•\tCommon Scenarios:\n\t•\tAfter a major suit opening, a double jump in a side suit is a splinter (e.g., 1♥–4♣ or 1♠–4♦) .\n\t•\tCan also occur at the three-level if the bidding structure allows (e.g., 1♥–3♠) .\n\t•\tKey Features:\n\t•\tThe short suit should ideally be a small singleton or void (not an honor like an Ace or King) .\n\t•\tThe bid limits the hand’s strength, helping partner decide on game or slam .\n\t•\tResponses:\n\t•\tPartner re-evaluates their hand based on the shortness. Honors in the splintered suit lose value, while honors in other suits gain value .\n\t•\tVariations:\n\t•\tSome partnerships use “mini-splinters” with less strength to explore part-score or game contracts .\n\t•\tSplinters can be used by either opener or responder, depending on context "
      }
    },
    {
      "id": "6fqxjsytCirXMbSZK7uY",
      "data": {
        "name": "Gambling 3NT",
        "text": "Definition: The Gambling 3NT opening bid in bridge describes a hand with a solid minor suit (at least 7 cards, headed by the Ace, King, and Queen) and little or no strength outside that suit.\n\n\t•\tRequirements for the Opener:\n\t•\tA solid minor suit of at least seven cards.\n\t•\tNo outside Ace or King in most partnership agreements (though some variations allow a side-suit Ace or King).\n\n\t•\tResponder’s Actions:\n\t•\tPass: If holding stoppers in three suits or two Aces, allowing 3NT to be the final contract.\n\t•\tBid 4♣: Asks opener to pass if the minor is clubs or correct to diamonds.\n\t•\tBid 4♦: Asks opener to describe their hand further:\n\t•\tShow shortness (singleton/void) in a major.\n\t•\tBid 4NT: Indicates four likely tricks and invites opener to explore slam with an eight-card suit."
      }
    },
    {
      "id": "6oyKCRuMpDWmkzWlArTs",
      "data": {
        "name": "Benji Acol",
        "text": "Benji Acol Overview\nKey Features\nStrong Two-Bids\n\n2♣: Artificial, showing a strong hand with either:\n8+ playing tricks in any suit, or\nA balanced hand with 21-22 points.\n2♦: Artificial, representing an even stronger hand:\n23+ points (balanced), or\nA game-forcing hand in any distribution.\nWeak Two-Bids\n\n2♥ and 2♠: Natural and preemptive, showing:\n6-10 points.\nA six-card suit.\nThese bids aim to disrupt opponents’ bidding while describing a weak hand.\nResponses to Strong Bids\n\nAfter a 2♣ or 2♦ opening, the responder usually bids:\n2♦ (after 2♣) or 2♥ (after 2♦) as a negative or waiting bid.\nNatural bids to show their own suit or strength.\n1NT Openings\n\nRetains the traditional Acol range of 12-14 points for balanced hands.\nCompetitive Auctions\n\nWeak two-bids allow for early preempts, making it harder for opponents to bid.\nUnlike traditional Acol, which uses strong two-bids in all suits, Benji Acol frees up space for preemptive bids in majors.\nAdvantages of Benji Acol\nMore flexibility: Keeps weak two-bids available in the majors.\nBetter hand differentiation: Uses artificial 2♣ and 2♦ to clarify strong hands.\nModern approach: Balances constructive bidding with effective disruption.\nSummary\nBenji Acol is popular because it allows clear communication of strong hands while maximising the use of weak preemptive bids. This makes it more dynamic and competitive than traditional Acol."
      }
    },
    {
      "id": "7zoW51P5JS8Iwz3Oredp",
      "data": {
        "name": "Roman Key Card2",
        "text": "●\nAce and Trump King Count: RKCB counts the king of trumps as a fifth \"ace\" in addition to the standard four aces.\n●\nQueen of Trumps: RKCB also allows the partnership to determine whether the queen of trumps is held.\n●\nResponses:\n○\nAfter a trump suit has been agreed, a bid of 4NT is used to ask for the number of \"aces\" the partner holds.\n○\nThe responses are:\n■\n5C = 0 or 3 \"aces\"\n■\n5D = 1 or 4 \"aces\"\n■\n5H = 2 \"aces\" and no queen of trumps\n■\n5S = 2 \"aces\" with the queen of trumps\n○\nThe responder can deduce whether partner holds the upper or lower count of aces after the 5C or 5D responses based on the bidding thus far.\n●\nAsking for Kings: After using 4NT, a bid of 5NT is an enquiry for kings and requires cue-bidding the kings in ascending order. If there are no kings, other than the trump king, the responder should return to the agreed suit.\n●\nShowing the Trump Queen and a King: When asking for the trump queen, if the partner holds it, they can show a vital king in the same response, saving the need to make an additional 5NT enquiry.\n●\nVoids: Hands with voids should generally start with a cue-bidding sequence to locate key cards. However, if a void is useful for the slam, then:\n○\n5NT is used to show an even number of \"aces\" plus the working void\n○\n6C shows an odd number of \"aces\" plus the working void.\n○\nTo ask for the queen of trumps, the next suit is bid (or the next if the immediate suit is trumps).\n●\nIntervention: If there is an intervening bid over 4NT, DOPI responses come into effect:\n○\nDouble = 0 or 3 aces\n○\nPass = 1 or 4 aces"
      }
    },
    {
      "id": "Ak2lzxqlzQJQa2oaoJUV",
      "data": {
        "name": "Capaletti (defense to 1NT)",
        "text": "The Cappelletti (sometimes spelled Capaletti) bridge convention is a defensive bidding system used over an opponent’s 1NT opening. It is a method of showing different hand types with interference bids, allowing the overcaller to describe their hand while disrupting the opponents’ no-trump auction.\n\nCappelletti Overcalls vs. 1NT\nWhen the opponent opens 1NT, the overcaller (the player next to the opener) can use Cappelletti to show a specific type of hand:\n\n2♣ → Any one-suited hand (partner must bid 2♦, then the overcaller clarifies their suit)\n2♦ → Both major suits (5-4 or better)\n2♥ → Hearts and a minor (5-4 or better)\n2♠ → Spades and a minor (5-4 or better)\n2NT → Both minor suits (at least 5-5)\nDouble → Originally penalty, but some partnerships use it for strength (optional)\nUsage and Strength Requirements\nThe 2♣ bid is flexible but should be at least a good 6-card suit.\nThe 2♦, 2♥, 2♠, and 2NT bids typically show at least 5-4 shape.\nHands should be roughly intermediate (8–15 HCP), depending on vulnerability and position."
      }
    },
    {
      "id": "B6c5x4QQGQtnJwKiiP2Q",
      "data": {
        "name": "Alerting and Announcing",
        "text": "Summary of the Announcement and Alert Guidelines (Effective 1 August 2024)\nGeneral Principles:\nAnnouncements only apply in the first round of bidding (first non-pass bid and next three calls).\nAnnouncements apply to intervention bids and advancer’s bids but not to overcalls or opening bids above 2NT.\nAlerts and announcements must extend with a fuller description where appropriate.\nTolerance is advised for opponents who mix alerts and announcements.\nSpecific Bidding Announcements:\nResponses to One Suit:\n\nNatural, forcing (non-jump): No announcement/alert.\nNatural, non-forcing: “Natural, non-forcing.”\nNatural, game-forcing (including jumps): “Natural, game-forcing” or “Natural, forcing.”\nArtificial bids: Alert or announce the specific suit.\nExample: A one-club opening followed by one-spade response might indicate \"No major.\"\nResponses to 1NT/2NT:\n\nTwo-clubs or three-clubs asking for 4-card majors: “Stayman,” extended if invitational.\nNatural bids: Announced based on forcing or non-forcing status.\nArtificial bids: Announce the suit shown.\nOpening Bids:\n\nOne-club or one-diamond: “May be X” (e.g., 0, 1, or 2 cards), extended if needed.\nOne no-trump: Announce the point range (e.g., “12 to 14”) and qualifiers like “may contain a low singleton.”\nTwo-suit openings: Indicate strength (e.g., “Weak,” “Intermediate”).\nDoubles:\nFirst Round of Bidding: Alerts required for non-penalty meanings or unexpected interpretations of doubles.\nAfter the First Round: No announcements/alerts for takeout or penalty doubles.\nAlerts for unusual meanings apply at all stages.\nRedoubles:\nFirst Round of Bidding: Announce specific suits shown.\nGeneral: No alerts for general strength or play intent, but alert for other unexpected meanings.\nAdditional Alerts:\nArtificial calls below three no-trump.\nSpecific natural bids with secondary suit meanings or partner support.\nLead-directing passes above three no-trump.\nThese guidelines are issued by the English Bridge Union (2024)."
      }
    },
    {
      "id": "D68VYLj1Q9yFwzxS9gQ9",
      "data": {
        "name": "Roman Key Card",
        "text": "ROMAN KEY-CARD BLACKWOOD\nA sophisticated variation of Blackwood in which the king of the trump suit is like a ‘fifth’ ace; the four aces and the king of trumps are all key cards. The usual responses to 4NT are:\n\n5♣ 0 or 3 Key Cards 5♦ 1 or 4 Key Cards*.\n\n5♥ 2 or 5 Key Cards but not the queen of trumps*.\n\n5♠ 2 or 5 Key Cards including the queen of trumps.\n\nAfter a 5♣ or 5♦ response, the 4NT bidder may continue with a bid in the lowest non-trump suit to enquire about the queen of trumps. The responder returns to the trump suit at the lowest level without the queen or, with it, bids 5NT or cue bids a second- round control. An alternative method is for responder to proceed: one step without the queen, two steps with it.\n\n* Some partnerships interchange the meaning of the 5♣ and 5♦ replies, the thinking being that the 4NT bidder is more likley to want to enquire further facing 1 than 0.\n\nThe 4NT bidder can continue with a bid of 5NT to ask for the non-trump kings. Responses can be to show the lowest king or on the standard step principle:\n\n6♣ 0 King\n6♦ 1 King\n6♥ 2 Kings\n6♠ 3 Kings\n\n\nRoman Keycard Blackwood is a powerful tool and popular amongst tournament players."
      }
    },
    {
      "id": "DLrqvvbgEmrFKvWfGKsL",
      "data": {
        "name": "Fourth Suit Forcing",
        "text": "Fourth Suit Forcing (FSF)\nDefinition:\n\nA bidding convention used when the first three bids between partners are in different suits.\nThe bid of the fourth suit does not indicate strength in that suit.\nIt signals a game-going hand and asks for more information about the partner’s hand.\nKey Points:\n\nPurpose: Helps gather details about the partner’s hand, such as distribution or stoppers, to determine the best contract.\nForcing Nature: The bid of the fourth suit is forcing and requires the partner to respond, keeping the bidding open.\nExample:\nSequence: 1♥ – 1♠ – 2♣ – 2♦\nThe 2♦ bid is FSF. It does not show strength in diamonds but asks the opener to clarify their hand.\nThe opener might:\nShow extra length in clubs.\nBid no-trump if they have a diamond stopper.\nPractical Tip:\n\nFSF is a valuable tool for uncovering partner’s hand details when you have a game-going hand but need more clarity on the final contract."
      }
    },
    {
      "id": "HWrnw3u7N2euA98rkQdv",
      "data": {
        "name": "Michaels Cue Bid",
        "text": "The Michaels Cue Bid is a conventional bid in contract bridge, used to describe a two-suited hand with at least five cards in each suit. It is primarily an overcall bid made after an opponent’s opening bid. Below are the key points:\nGeneral Characteristics\n\t•\tPromises two five-card suits (5-5 distribution or better).\n\t•\tRequires at least 8 high-card points (HCP) for standard use.\n\t•\tCan be used with weak (8–12 HCP) or strong hands (16+ HCP), but not with intermediate hands (13–15 HCP) in some variations like Mini-Maxi Michaels.\n\t•\tEmphasis is on trick-taking potential, with points concentrated in long suits.\nWhen to Use\n\t1.\tOver Opponent’s Minor Suit Opening:\n\t•\tA cue bid of the minor suit (e.g., 1♣ – 2♣) shows both major suits (hearts and spades).\n\t2.\tOver Opponent’s Major Suit Opening:\n\t•\tA cue bid of the major suit (e.g., 1♠ – 2♠) shows the other major suit and an unspecified minor suit.\n\t•\tPartner can use a 2NT relay bid to ask for the minor suit.\nPoint Ranges\n\t•\tWeak (8–12 HCP): Use Michaels to disrupt opponents or find a sacrifice.\n\t•\tIntermediate (13–15 HCP): Avoid Michaels; bid suits separately.\n\t•\tStrong (16+ HCP): Use Michaels and follow up with a strong second bid.\nResponses by Partner\n\t•\tAssume the Michaels bidder has a weak hand unless clarified with further bidding.\n\t•\tPossible responses:\n\t•\tPreference Bid: Choose one of the indicated suits.\n\t•\tJump Preference: Preemptive, showing extra length/support.\n\t•\tCue Bid of Opponent’s Suit: Game or slam try.\n\t•\t2NT: Asks for the minor suit when one is unspecified.\n\t•\t3NT: To play if a stopper exists in the opponent’s suit.\nRebids by Michaels Bidder\n\t•\tWith weak hands (<12 HCP): Pass or raise partner’s preference preemptively.\n\t•\tWith strong hands (16+ HCP): Make a new suit bid to invite game.\nStrategic Considerations\n\t•\tEffective as a disruptive tool, taking away bidding space from opponents.\n\t•\tVulnerability impacts usage:\n\t•\tAt favorable vulnerability, weaker hands can be used more freely.\n\t•\tAt unfavorable vulnerability, stronger hands are recommended to avoid penalties.\nThe Michaels Cue Bid is a versatile convention that helps communicate two-suited hands effectively while pressuring opponents’ bidding space."
      }
    },
    {
      "id": "RnYEgmAtJevvevjvWS2d",
      "data": {
        "name": "Directional Asking Bid",
        "text": "A directional asking bid (DAB) is a type of cue bid used in contract bridge to help determine if a no-trump contract is feasible. It involves bidding the opponents’ suit to ask partner for help in that suit, typically when considering a 3NT contract.\nKey features of a directional asking bid include:\n\t1.\tIt is made after the opponents have bid a suit.\n\t2.\tIt asks partner to bid no-trump if they have at least a partial stopper in the opponents’ suit.\n\t3.\tA partial stopper can be as little as Qx or Jxx in the suit.\n\t4.\tThe DAB bidder usually has at least a partial stopper themselves.\nThe DAB serves two main purposes:\n\t1.\tTo discover if the partnership has a combined stopper in the opponents’ suit.\n\t2.\tTo steer the contract into the partner’s hand, especially if the DAB bidder wants the lead to come up to their partner’s holding.\nFor example, after an auction where three suits have been bid, a bid of the opponents’ suit can be used as a DAB. This bid is forcing and alerts partner to the possibility of a 3NT contract, asking them to bid 3NT with a partial stop in the opponents’ suit.\nIt’s important to note that directional asking bids should be alerted during the auction, as they are conventional bids with a specific meaning."
      }
    },
    {
      "id": "TM7pJ2FBacPSm1o3Xn7z",
      "data": {
        "name": "Defense to Weak Twos",
        "text": "Lebensohl\n\n\nThis convention was not designed for defending against weak 2’s but it works well.\n●\nIt is used in response to a partner's take-out double of a Weak 2.\n●\nA bid of 2NT shows a minimum response.\n●\nThe doubler is forced to rebid 3C.\n●\nIf 3C is the responder’s suit, they pass.\n●\nIf 3C is not the responder’s suit, they bid their own suit at the 3-level, indicating a weak hand.\n●\nResponding at the 3-level, without using Lebensohl, shows a decent hand with 8-11 points.\n●\nThe purpose of Lebensohl is to regain some of the bidding space lost due to the Weak 2 opening.\n●\nIt allows the partnership to distinguish between a minimum and a stronger response after a take-out double of a weak 2 bid.\n●\nIt is useful because after the opponents open with a weak two bid, the responder loses a round of bidding and can no longer make normal responses as they could over a 1-level opening bid."
      }
    },
    {
      "id": "WmAvrV3IUQzaoI9bq3Od",
      "data": {
        "name": "Unassuming Cue Bid",
        "text": "The Unassuming Cue Bid (UCB) is a bridge convention used to show support for a partner’s overcall and invite further bidding. It involves bidding the opponent’s suit, which is why it is called a “cue bid.” The key features of the UCB are:\nPurpose\n\t•\tShows Support: Indicates at least 3-card support for your partner’s overcalled suit, ensuring an 8-card fit.\n\t•\tGame Interest: Signals 10+ points and interest in exploring game-level contracts, depending on partner’s hand strength.\nWhen to Use\n\t•\tAfter your partner has made a suit overcall (e.g., opponent opens 1♦, partner overcalls 1♠, you bid 2♦ as the UCB).\n\t•\tYou have at least 10 points and sufficient support for your partner’s suit.\nAdvantages\n\t1.\tForces Partner to Describe Their Hand: The UCB asks your partner to clarify the strength of their overcall. They can:\n\t•\tRebid their suit with a minimum hand.\n\t•\tShow a second suit or bid no-trump to indicate stoppers in the opponent’s suit if stronger.\n\t2.\tPreemptive Value: Direct raises of your partner’s suit can then be used as weak preemptive bids, while the UCB is reserved for stronger hands.\nExample\nIf the bidding sequence is:\n\t•\tOpponent: 1♦\n\t•\tPartner: 1♠ (overcall)\n\t•\tYou: 2♦ (UCB)\nThis shows:\n\t•\tAt least 10 points.\n\t•\tAt least 3-card spade support. Your partner will now describe their hand further to help decide the final contract.\nThe UCB is an effective tool for competitive bidding, allowing partnerships to explore game possibilities while staying at safe levels if needed."
      }
    },
    {
      "id": "ZX5HynmD01QbLB1dG3vq",
      "data": {
        "name": "Ghestem",
        "text": "\t•\tDefinition: The Ghestem convention is a bridge bidding system for overcalling an opponent’s one-level opening bid to show a two-suited hand with at least 5-5 distribution. It was devised by Pierre Ghestem of France.\n\t•\tPurpose: It uniquely identifies the two suits held by the overcaller, providing clarity in competitive bidding.\n\t•\tBidding Structure:\n\t•\t2NT: Shows the two lowest-ranking unbid suits (e.g., over 1♠, it shows ♥ and ♦).\n\t•\t3♣: Shows the two highest-ranking unbid suits (e.g., over 1♦, it shows ♠ and ♥).\n\t•\tCue Bid (of opener’s suit): Shows the top and bottom-ranking unbid suits (e.g., over 1♥, it shows ♠ and ♣).\n\t•\tModifications for 1♣ Opening:\n\t•\tTo retain a natural 2♣ overcall, adjustments are made:\n\t•\t2NT: Red suits (♥ and ♦).\n\t•\t2♦: Majors (♠ and ♥).\n\t•\t3♣: Diamonds and spades.\n\t•\tStrength Requirements:\n\t•\tTypically requires opening-level strength or better.\n\t•\tSome partnerships allow weak or strong hands but discourage intermediate hands to avoid ambiguity.\n\t•\tAdvantages:\n\t•\tPrecisely identifies the two suits, unlike other conventions like Michaels cuebid that leave one suit unspecified.\n\t•\tUseful for hands with extreme distributions.\n\t•\tDisadvantages:\n\t•\tLoses the natural meaning of the 3♣ jump overcall.\n\t•\tForces bidding to higher levels compared to other conventions like Michaels, which can be less competitive at lower levels.\n\t•\tProne to memory lapses due to its complexity.\n\t•\tAlternative Variants:\n\t•\tVariations such as Questem and CRO adjust suit orders or meanings to address some drawbacks of the original Ghestem convention."
      }
    },
    {
      "id": "ZkD3dsD6Gj53RDC4qlGh",
      "data": {
        "name": "Defence to 1NT Doubled",
        "text": "In this defense to a double of 1NT, the opener always redoubles, and their partner must initially pass. The redouble does not indicate additional strength, as the 1NT opening is already a limit bid. Instead, it serves to give the responder flexibility: they can make a weak takeout bid with a poor hand or leave the double in if confident the contract will succeed. This strategy unsettles the opponents by obscuring the point distribution, making it difficult for them to gauge the balance of power and often forcing them into suboptimal bids."
      }
    },
    {
      "id": "a6gmvumTKTdfWdh7zCyy",
      "data": {
        "name": "Redoubles",
        "text": "The Redouble in Acol Bridge: Responding to a Takeout Double\n\nIn the Acol bridge bidding system, when your partner opens the bidding and your right-hand opponent (RHO) makes a takeout double, a redouble by you (the responder) conveys specific information about your hand and partnership strategy. Here’s what it signifies:\n\n1. Point Count\nA redouble promises at least 10 high-card points (HCP), indicating your side likely holds the majority of the total points in the deal.\n2. Message to Partner\nA redouble communicates confidence in your side’s overall strength and the potential to penalize the opponents if they bid further.\nIt sets up a penalty situation: any subsequent double by you is a penalty double, which must be left in.\n3. Strategic Implications\nA penalty double following a redouble is definitive and aims to maximize your side’s score.\nAlternatively, you might plan to:\nRebid in notrump, showing balanced strength.\nRaise your partner’s suit:\nA subsequent bid of your partner’s suit shows exactly three-card support, as the redouble initially denies holding four-card support.\n4. When Not to Redouble\nA redouble should not be used indiscriminately with 10+ points. It is most effective when you have:\nDefensive strength in the unbid suits.\nA clear plan for the continuation of the auction after the opponents’ response.\nAdditional Considerations\nA redouble does not indicate the shape of your hand beyond denying four-card support for your partner’s suit.\nIt is a flexible and assertive bid that highlights strength while allowing your partnership to explore the best contract, whether through penalties or a constructive continuation."
      }
    },
    {
      "id": "bk2UoWlsde3FWZGDYvv0",
      "data": {
        "name": "Suit Signalling Methods",
        "text": "Bridge Signaling Conventions\nMcKenney (Suit Preference) Signals\nA discard signals preference for a specific suit.\nA high card requests the higher-ranking remaining suit, while a low card requests the lower-ranking remaining suit.\nExample: Discarding a high diamond suggests interest in hearts (the next higher suit).\nReverse Attitude Signals\nThe opposite of standard attitude signals.\nA low card encourages continuation of the suit led by partner.\nA high card discourages continuation.\nRevolving Discards\nSimilar to McKenney signals but emphasizes rotation among suits.\nA high card discard suggests interest in the next higher-ranking suit.\nA low card discard suggests interest in the next lower-ranking suit.\nExample: Discarding a high heart signals interest in spades.\nStandard Attitude Signals\nA high card encourages continuation of the suit led by partner.\nA low card discourages continuation.\nCount Signals\nUsed to indicate the number of cards held in a suit.\nPlaying high-low shows an even number of cards in the suit.\nPlaying low-high shows an odd number of cards in the suit.\nLavinthal (Suit Preference) Discards\nA discard of a high card signals interest in the higher-ranking of the two remaining suits.\nA discard of a low card signals interest in the lower-ranking suit.\nSmith Echo (Defensive Signal against No-Trump contracts)\nOn declarer’s first play in a side suit, defenders use a high card to indicate interest in the opening lead suit, while a low card discourages it.\nOdd-Even (Roman) Discards\nAn odd-numbered card discard encourages the suit discarded.\nAn even-numbered card discard discourages that suit but may indicate suit preference.\n"
      }
    },
    {
      "id": "grJmdk0fyn8Jos7uXot4",
      "data": {
        "name": "Pudding Raise",
        "text": "A pudding raise in bridge is a specific bidding convention with the following key characteristics:\n\t1.\tFour-card support for partner’s opened major suit (hearts or spades)\n\t2.\tA balanced or semi-balanced hand distribution, typically 4-3-3-3 or 4-4-3-2\n\t3.\t13-15 high card points (HCP)\n\t4.\tNo singleton or void\n\t5.\tSeven losers in the hand\n\t6.\tEnough strength to expect to make game\nThe pudding raise is executed by bidding 3NT immediately after partner’s opening bid of 1♥ or 1♠. This convention allows the responder to differentiate between a balanced hand with high card strength and a more distributional hand with less high card strength but good trump support.\nBy using the pudding raise, partnerships can more accurately describe their hands, potentially leading to better contract choices, especially in pairs tournaments where the extra 10 points for playing in 3NT instead of 4 of a major can be significant."
      }
    },
    {
      "id": "kMbT3xRWux0OYqKTuYZC",
      "data": {
        "name": "Weak Twos",
        "text": "Weak Two Opening Bid in Bridge\nA Weak Two Opening Bid is a preemptive bid designed to disrupt opponents' bidding and communicate a specific hand type to your partner. Here are the key guidelines:\n\nCriteria for a Weak Two Bid\nSuit Length: Promises a 6-card suit.\nHigh Card Points (HCP): Typically, the hand contains 6-10 HCP.\nSuit Quality: The suit should include at least two honors (e.g., Ace, King, Queen; sometimes a 10 if accompanied by higher honors).\nNo Side 4-Card Major: Avoid a Weak Two if you have a 4-card major in another suit, as this may cause the partnership to miss a better fit.\nPosition and Vulnerability:\nBe more cautious when vulnerable due to higher penalties for going down.\nFirst seat: More aggressive bidding is allowed.\nSecond seat: Should be sound and careful.\nThird seat: Can be looser to disrupt opponents.\nWhen Not to Use a Weak Two\nIf the hand qualifies for an opening bid under the Rule of 20 (HCP + length of two longest suits ≥ 20).\nIf holding a 7-card suit or stronger hand, consider a higher preempt or different opening strategy.\nIn fourth seat after three passes, unless you have 10-13 HCP and want to compete.\nResponses to a Weak Two\nPass: If you have a weak hand with no interest in advancing.\nRaise of the Bid Suit: Extends the preempt and is not forcing.\n2NT Enquiry: Responder uses the 1,2:1,2,3 principle:\n3 Clubs = lower end of range with 1 honor.\n3 Diamonds = lower end with 2 honors.\n3 Hearts = upper end with 1 honor.\n3 Spades = upper end with 2 honors.\n3NT = upper end with 3 honors.\nAdvantages of Weak Twos\nDisrupts opponents' strategies, making it harder for them to find their best contract.\nHelps your partner determine an effective opening lead if opponents win the auction.\nBy following these guidelines, Weak Two bids can effectively disrupt opponents while providing clear communication within your partners"
      }
    },
    {
      "id": "tzdFF5PHH7SWXaWoIKaj",
      "data": {
        "name": "Crowhurst",
        "text": "\t•\tPurpose: The Crowhurst Convention is a bidding mechanism in bridge designed to refine the description of the opener’s hand after a wide-ranging 1NT rebid (commonly 12-16 points) by the opener.\n\t•\tTrigger: It is initiated by the responder’s artificial bid of 2♣, which serves as an enquiry about the opener’s hand strength and distribution.\n\t•\tResponses by Opener:\n\t•\t2♦: Minimum hand (12-14 points) without five hearts or three spades.\n\t•\t2♥: Minimum hand with five hearts.\n\t•\t2♠: Minimum hand with three spades but not five hearts.\n\t•\t2NT: Maximum hand (15-16 points).\n\t•\tVariations exist for different NT ranges, e.g., 15-17 or 15-18 points, with slight adjustments to responses.\n\t•\tResponder’s Role:\n\t•\tTypically holds 7-9 points but can use the convention with stronger hands to explore game or slam possibilities.\n\t•\tMay proceed to game or further investigate based on opener’s response.\n\t•\tPhilosophy:\n\t•\tHelps clarify whether to pursue part-scores, game, or slam contracts.\n\t•\tEmphasizes precision in describing hand strength and support for responder’s suit, especially for balanced hands.\n\t•\tCompatibility: Commonly used in conjunction with ACOL systems and weak NT openings but adaptable to other frameworks like 15-17 NT rebids"
      }
    },
    {
      "id": "uQ0c46l08t1Qu6UCndIo",
      "data": {
        "name": "Trial Bids",
        "text": "Key Points About Trial Bids in Bridge\nTrial bids are a bidding tool in bridge used to evaluate whether to bid for game after a fit has been established, typically in a major suit. Here’s a detailed breakdown:\nDefinition and Purpose\n\t•\tA trial bid is a bid of a new suit after a trump suit has been agreed upon. It invites the partner to bid higher (usually to game) if they have suitable cards to help in the trial suit or to sign off otherwise.\n\t•\tThe goal is to explore the possibility of game when the combined hands are close to game-level strength but uncertain.\nTypes of Trial Bids\n\t1.\tLong Suit Trial Bids:\n\t•\tThese indicate weakness in a specific long suit (e.g., three potential losers like 532 or A753) and ask the partner for help, either through high cards (honors) or shortage in that suit.\n\t•\tTypically used when a major suit fit is agreed upon.\n\t2.\tShort Suit Trial Bids:\n\t•\tThese show a shortage (singleton or void) in the bid suit and ask the partner for length or honors in that suit.\n\t•\tOften used when investigating no-trump contracts or minor-suit games.\nWhen to Use Trial Bids\n\t•\tAfter an opener bids one of a major suit and the responder raises it to two, showing 6–9 points with trump support.\n\t•\tThe opener uses a trial bid to seek help in a weak side suit, aiming to decide whether game is feasible.\nResponding to Trial Bids\n\t•\tPositive Response: If the responder has help in the trial suit (e.g., honors like A, Kx, Qxx, or shortness), they should accept the invitation and bid game.\n\t•\tNegative Response: If the responder cannot provide help, they should sign off at three of the agreed trump suit.\nExamples\n\t1.\tLong Suit Trial Bid:\n\t•\tAuction: 1♥ - 2♥ - 3♦\n\t•\tThe opener asks for help in diamonds. If the responder has honors or shortness in diamonds, they bid 4♥; otherwise, they pass with 3♥.\n\t2.\tShort Suit Trial Bid:\n\t•\tAuction: 1♦ - 2♦ - 2♠\n\t•\tThe opener shows a spade shortage and asks if the responder can cover it. Responses depend on whether the responder has spade stoppers or not.\nAdvantages\n\t•\tHelps avoid unmakeable games by gauging combined strength more accurately.\n\t•\tOffers flexibility and precision compared to direct game bids or simple raises.\nTrial bids are an essential tool for competitive bidding, enabling partnerships to make informed decisions about pursuing game contracts."
      }
    },
    {
      "id": "wZkVDz3ewbmEegXrw82R",
      "data": {
        "name": "Unusual No Trump",
        "text": "\t•\tDefinition: The Unusual No Trump (UNT) is a conventional overcall made after an opponent opens the bidding. It is artificial and does not indicate a desire to play in no-trump but instead shows a two-suited hand with at least 5-5 distribution in the two lowest unbid suits.\n\t•\tPurpose:\n\t•\tTo describe the hand’s distribution to the partner succinctly.\n\t•\tTo preempt opponents by taking away bidding space.\n\t•\tSuit Indication:\n\t•\tOver a major suit opening (1♥ or 1♠), a 2NT overcall shows both minor suits (clubs and diamonds).\n\t•\tOver a minor suit opening (1♣ or 1♦), a 2NT overcall shows the other minor and hearts.\n\t•\tStrength:\n\t•\tTypically made with weak hands (6–11 points) but highly unbalanced distribution.\n\t•\tStrong two-suited hands can also use UNT, but intermediate-strength hands (12–14 points) often avoid it, opting for other bidding strategies.\n\t•\tResponses by Partner:\n\t•\tThe partner of the UNT bidder (Advancer) must bid unless there is an intervening bid.\n\t•\tWith no clear fit, the Advancer chooses the least objectionable suit.\n\t•\tWith a good fit, the Advancer can jump in that suit or even force to game depending on strength.\n\t•\tAdvanced Usage:\n\t•\tA similar convention, “Unusual vs. Unusual,” can counteract UNT bids.\n\t•\tAt higher levels (e.g., 4NT), the bid remains “unusual” and shows extreme two-suited hands, often with even longer suits (e.g., 6-6 distribution).\n\t•\tDrawbacks:\n\t•\tProvides opponents with information about hand distribution, which may improve their declarer play if they win the contract"
      }
    }
  ],
  "keyIdeas": [
    {
      "id": "9EffOPEhzczqbo42GX1P",
      "data": {
        "name": "Preemptive Bids",
        "text": "Summary of Preemptive Bridge Bids\nPreemptive bids are high-level opening or overcalling bids made with weak hands and long suits. Their primary purpose is to disrupt opponents’ bidding space while providing partner with a clear description of your hand. The most common types include:\n* Weak Two-Opening Bids (2♦, 2♥, 2♠)\n* Three-Level Opening Bids (3♣, 3♦, 3♥, 3♠)\n* Jump Overcalls\n\n1. Opening Weak Twos\nDefinition:\nA Weak 2-opening (e.g., 2♦, 2♥, or 2♠) shows:\n* A six-card suit, with most of your strength concentrated there.\n* Typically 5–10 HCP.\n* A hand unsuitable for a one-level opening bid (too weak or unbalanced).\nPurpose:\n* To describe your hand in a single bid.\n* To make it harder for opponents to bid effectively.\nWhen to Use:\n✔️ Six-card suit with at least two honors (e.g., KQxxxx). ✔️ Little defensive strength outside your long suit. ✔️ Favorable vulnerability (safer to preempt).\nWhen Not to Use:\n❌ Significant defensive values (e.g., an outside ace or king). ❌ A balanced hand or a four-card major in an unbid suit. ❌ Vulnerable, unless confident the bid won’t result in heavy penalties.\n\n2. Opening Weak Threes\nDefinition:\nA three-level preempt (e.g., 3♣, 3♦, 3♥, or 3♠) shows:\n* A seven-card suit, with most of your strength concentrated there.\n* Typically 7–11 HCP.\nPurpose:\n* To disrupt opponents' communication by forcing them to bid at a higher level.\nWhen to Use:\n✔️ Seven-card suit with reasonable quality (e.g., KQJxxxx). ✔️ Little strength outside your long suit. ✔️ Favorable or neutral vulnerability.\nWhen Not to Use:\n❌ Significant defensive values outside your suit. ❌ Unfavorable vulnerability (higher risk of penalties). ❌ Partner has already passed but your hand has defensive potential.\n\n3. Preemptive Jump Overcalls\nDefinition:\nA jump overcall skips levels when intervening after opponents open the bidding. It shows:\n* A long suit (six cards for a two-level jump, seven for a three-level jump).\n* Few defensive values and typically less than opening strength.\nPurpose:\n* To disrupt opponents' bidding while clearly describing hand length and weakness to partner.\nWhen to Use:\n✔️ Long, strong suit (e.g., KQJxxx). ✔️ Weak hand with little outside strength.\nWhen Not to Use:\n❌ Significant defensive values outside the long suit. ❌ Unfavorable vulnerability unless penalties are unlikely.\n\nPros & Cons of Preemptive Bids\n✅ Pros\n✔️ Disrupts opponents’ bidding by taking away space. ✔️ Communicates hand type (long suit, limited strength). ✔️ Forces opponents into riskier contracts with limited information.\n❌ Cons\n❌ Risk of penalties if doubled, especially when vulnerable. ❌ Limits partner's options, making it harder to explore game/slam. ❌ Potential misjudgment—partner may overestimate your strength.\n\nWhen to Avoid Preemptive Bids\n❌ Partner has not passed:\n* If partner has a strong hand, they may need bidding space to explore game or slam.\n* Example: You open 3♦, but partner has a strong balanced hand with stoppers and planned to bid no-trump. Your bid blocks their investigation.\n❌ Unfavorable vulnerability:\n* A failed preempt can lead to heavy penalties if doubled.\n* Example: Vulnerable at matchpoints, you open 3♠ with ♠KQJxxxx and no outside values. Opponents double and set you three tricks for –800 points.\n❌ Defensive hand:\n* Hands with outside aces or kings may be better for defense than preempting.\n* Example: Holding ♠KQJxxx ♥A ♦KJx ♣xx, the outside values make this too strong defensively for a preempt.\n❌ Poor suit quality:\n* Avoid preempts if your long suit lacks honors, reducing trick potential.\n\nFinal Thoughts\nPreemptive bids are powerful tools when used wisely. They work best when: ✔️ You have a long suit with limited high-card points. ✔️ Vulnerability is favorable or neutral. ✔️ Partner has already passed (reducing the risk of blocking strong hands).\nHowever, be cautious when partner may need room to explore contracts, or when vulnerable against strong opponents. Balancing aggression with judgment ensures preemptive bids help your partnership rather than backfire.\n"
      }
    },
    {
      "id": "Ck0fIYlQfmcLSOA4arTe",
      "data": {
        "name": "Losing Trick Count",
        "text": "The Losing Trick Count (LTC) is a hand evaluation method in bridge designed to estimate the trick-taking potential of a partnership’s hands in a suit contract. It is most effective when a trump fit has been established and is used as an alternative or supplement to high card point (HCP) evaluation.\nKey Principles of the Losing Trick Count:\n\t1.\tCounting Losers:\n\t•\tOnly the first three cards in each suit are considered.\n\t•\tA suit’s losers are determined by the absence of high honors (Ace, King, Queen):\n\t•\tThree or more cards: Count one loser for each missing honor (e.g., A-x-x = 2 losers; K-Q-x = 1 loser).\n\t•\tDoubleton: Count as 2 losers unless it includes an Ace (e.g., Q-x = 2 losers; A-Q = 0.5 loser).\n\t•\tSingleton: Count as 1 loser unless it is an Ace (0 losers).\n\t•\tVoid: Counts as 0 losers.\n\t2.\tMaximum Losers:\n\t•\tEach hand can have at most 12 losers (3 per suit).\n\t3.\tCombined Losers:\n\t•\tAdd the losing trick counts of both hands in the partnership.\n\t•\tSubtract this total from 24 to estimate the number of tricks the partnership can expect to win (e.g., 24 - combined losers = expected tricks).\n\t4.\tApplication:\n\t•\tLTC is only valid when there is an established trump fit (typically at least 8 cards combined).\n\t•\tIt works best for unbalanced hands, where distribution and ruffing potential are key factors.\n\t5.\tAdjustments for Accuracy:\n\t•\tSome players make adjustments for intermediate honors (Jacks, Tens) and hand shape.\n\t•\tThe method assumes normal suit distributions and that finesses succeed about half the time.\nExample Calculation:\n\t•\tHand A: ♠ A-Q-8-3-2, ♥ J-8-7-5-3, ♦ 7-2, ♣ Void\n\t•\t♠: 1 loser (missing K)\n\t•\t♥: 3 losers (missing A, K, Q)\n\t•\t♦: 2 losers (missing A, K)\n\t•\t♣: 0 losers (void)\n\t•\tTotal: 6 losers.\n\t•\tHand B: ♠ K-Q-J-6-5-2, ♥ A-7-3-2, ♦ A, ♣ Void\n\t•\t♠: 1 loser (missing A)\n\t•\t♥: 2 losers (missing K, Q)\n\t•\t♦: 0 losers\n\t•\t♣: 0 losers\n\t•\tTotal: 3 losers.\nCombined Losers = 6 + 3 = 9\nExpected Tricks =  tricks.\nAdvantages:\n\t•\tLTC provides a more accurate assessment of trick potential in suit contracts compared to point count alone.\n\t•\tIt emphasizes distributional strength and ruffing potential.\nLimitations:\n\t•\tNot suitable for no-trump contracts or misfit hands.\n\t•\tAssumes normal distributions and does not account for defensive considerations.\nBy combining LTC with standard point count methods, players can better evaluate the potential of their hands in suit contracts.",
        "userId": "kmohX5w4bWVBxAAcKIbfrckLz8r2",
        "timestamp": {
          "_seconds": 1740748168,
          "_nanoseconds": 918000000
        }
      }
    },
    {
      "id": "DvlRv3Boqt9vFbMROWvs",
      "data": {
        "name": "Redoubles",
        "text": "The Redouble\n\nIf partner bids a suit and LHO overcalls a redouble by you shows:\n\n1. At least 10+points\n2. Denies 4 Card Support for partner’s suit\n3. Because you know your partnership has the balance of points, a subsequent double is for penalties"
      }
    },
    {
      "id": "KXVAF6EzuVXe3XdGNtEq",
      "data": {
        "name": "Overcalls",
        "text": "●\nA 5-card suit is always required for a simple overcall. There should never be any compromise on this factor.\n●\nWith a spade suit, it's more important to bid than to worry about suit quality.\n●\nWhen considering an overcall, one should consider how much obstruction it will cause and how well the hands will fit.\n●\nOvercalling in the \"sandwich position\" (between the responder and opener) is dangerous with little to gain.\n●\nVulnerability is not very important for a 1-level overcall, but it is very important at the 2-level and higher.\n●\nIt's important to recognize that overcalls can be weaker than opening bids.\nTypes of Overcalls:\n●\nSimple Overcalls:\n○\nAt the 1-level, they show a 5-card suit and a point range of 7-17 points, but usually 9-12 points.\n○\nAt the 2-level, they require an opening hand with a 5 or 6-card suit.\n●\nWeak Jump Overcalls:\n○\nThese promise a 6-card suit of good quality and are primarily obstructive.\n○\nAt the 2-level, the point range should be about 5-9 points; at the 3-level, maybe 6-10 points.\n●\nMichaels Cue-bids:\n○\nThese show a two-suited hand with at least 5-5 distribution, and 10 or more points.\n○\nA cue bid of a minor suit shows both major suits; a cue bid of a major suit shows the other major suit and one of the minor suits.\n●\nUnusual No-Trump Overcalls:\n○\nThese show a 5-5 or longer distribution in the two lowest-ranking unbid suits, with 10+ points.\n○\nThe Unusual No-Trump should not be used in the protective position.\n●\n1NT Overcall:\n○\nCan be made with a balanced hand of 16-18 points or a hand with a long suit.\n○\nRequires two stoppers in the opponent's suit when overcalling with a flat, balanced hand, but only one stopper if you have a solid source of tricks.\nResponding to Overcalls:\n●\nA raise of partner's suit is based purely on the Total Trumps Principle, reflecting how many trumps are held by the partnership.\n●\nRaises in partner's suit show no points, but deny interest in game.\n●\nA change of suit is non-forcing, showing a good-quality 5-card suit or longer.\n●\nNT responses should be stronger than usual, as the overcall could be very weak.\n●\nAn Unassuming Cue-bid asks the overcaller whether they are minimum or maximum for their overcall and shows 3-card support.\n●\nFit-jumps can be used to help partner judge whether to sacrifice, showing values concentrated in support and in your own suit.\nSpecific Suit Considerations:\n●\nSpades: It is particularly important to enter the auction with a spade overcall, even with minimum points and compromised suit quality, due to its obstructive potential. Overcalling spades should become an obsession.\n●\nOther suits: Overcalls with suits other than spades may warrant passing if the risk is too high for the gain.\nBalancing and Protective Bidding:\n●\nBalancing, or protective bidding, can be used to re-open the auction, pressuring opponents to a higher level, or stealing a contract at a safe level.\n●\nIn the balancing position, simple overcalls should always be a 5-card suit but can have a wider range of points (about 6-14)."
      }
    },
    {
      "id": "SDeEVsA3Dr3molpk135E",
      "data": {
        "name": "The Law of Total Trumps",
        "text": "The Principle of Total Trumps, also known as the Law of Total Tricks (LOTT), is a guideline in bridge that helps players estimate the total number of tricks available in a deal during competitive bidding. It is particularly useful when deciding how high to bid in auctions where both partnerships are competing for the contract.\nKey Concepts of the Principle\n\t1.\tTotal Number of Trumps:\n\t•\tThe total number of trumps is the combined length of each partnership’s longest trump suit.\n\t•\tFor example, if one partnership has an 8-card trump fit and the other has a 9-card fit, the total number of trumps is .\n\t2.\tTotal Number of Tricks:\n\t•\tThe principle states that the total number of tricks available in a deal (assuming best play and defense) is approximately equal to the total number of trumps held by both partnerships combined.\n\t3.\tPractical Application:\n\t•\tIn competitive bidding, bid to the level corresponding to your partnership’s total number of trumps.\n\t•\tWith an 8-card trump fit, bid to the 2-level.\n\t•\tWith a 9-card trump fit, bid to the 3-level.\n\t•\tWith a 10-card trump fit, bid to the 4-level.\n\t4.\tCompetitive Auctions:\n\t•\tThe principle is most effective when both sides are competing for the contract, and high card points (HCP) are roughly balanced between the partnerships.\n\t•\tIt assumes that each side plays in their best trump fit.\nExample\n\t•\tNorth-South has an 8-card spade fit, and East-West has a 9-card heart fit.\n\t•\tTotal trumps = .\n\t•\tAccording to LOTT, there should be approximately 17 total tricks available across both partnerships.\nAdjustments and Limitations\n\t•\tThe principle is not always exact; it works best for hands with balanced or moderately unbalanced distributions.\n\t•\tAdjustments may be needed for:\n\t•\tHighly unbalanced hands or extreme distributions.\n\t•\tStrong or weak defensive holdings.\n\t•\tStudies suggest LOTT is accurate within one trick on most deals but less reliable at higher trick counts (e.g., when both sides have long trump fits).\nWhy It’s Useful\nThe Principle of Total Trumps simplifies decision-making in competitive auctions by focusing on trump length rather than just HCP. It helps determine whether to compete further or defend based on the safety of bidding to your partnership’s “trump level.”",
        "userId": "kmohX5w4bWVBxAAcKIbfrckLz8r2",
        "timestamp": {
          "_seconds": 1740748447,
          "_nanoseconds": 356000000
        }
      }
    },
    {
      "id": "WXUbuSdiDQKS9ta4kjM8",
      "data": {
        "name": "Shortage Points",
        "text": " Shortage points are added to hand valuation once a trump suit has been agreed upon. This method evaluates the ruffing potential of short suits, which becomes more significant in suit contracts. The specific values assigned for shortages are as follows:\n\t•\tVoid (0 cards): 5 points\n\t•\tSingleton (1 card): 3 points\n\t•\tDoubleton (2 cards): 1 point\nThese values assume that the hand has at least three trumps to support ruffing. If the hand has four or more trumps, the same values are typically applied, as the additional trumps enhance ruffing potential.\nShortage points are added to the High Card Points (HCP) to give a total valuation of the hand. They are particularly useful for evaluating unbalanced hands in suit contracts.",
        "userId": "kmohX5w4bWVBxAAcKIbfrckLz8r2",
        "timestamp": {
          "_seconds": 1740748014,
          "_nanoseconds": 42000000
        }
      }
    },
    {
      "id": "XbDhcE4xLxQ7e3Gcq6ak",
      "data": {
        "name": "Opening Leads Against No Trumps",
        "text": "Good Leads Against No Trump\nSequence of Honors: Lead the top card from touching honors (e.g., KQJx, QJ10x, J109x).\nFourth-Highest Card: Lead the fourth card from your longest and strongest suit to establish length tricks.\nPartner’s Bid Suit: If partner has bid a suit, leading it is usually best.\nInterior Sequences: Lead the second-highest card from interior sequences (e.g., KJ10x → lead the J).\nPassive Leads (If No Good Active Option): If declarer appears strong, consider leading a neutral suit to avoid giving away tricks.\nLeads to Avoid Against No Trump\nSingletons or Doubletons: Unlike suit contracts, short-suit leads are usually ineffective in No Trump.\nUnsupported Honors: Avoid leading away from suits like Kxx or Qxx, as declarer may capture your honor.\nAces Without Kings: Leading an Ace without the King can give declarer a free finesse.\n"
      }
    },
    {
      "id": "XqNnkqrjWno6VOyMgeJa",
      "data": {
        "name": "Opening leads against Suit Contracts",
        "text": "Good Leads\nPartner’s Bid Suit: Lead low from three or more cards or high from a doubleton.\nSingleton: A strong attacking lead, aiming for a ruff when partner regains the lead.\nSequence of Honors: Lead the top card from touching honors (e.g., KQJx, QJ10x).\nFourth-Highest Card: Lead from your longest suit when no honor sequence is present.\nTrump Lead: Useful when declarer has shown a two-suited hand or to disrupt cross-ruffing.\nNeutral (Passive) Leads\nDoubleton: Lead the top card of a two-card holding.\nLow from Unsupported Honors: Lead a low card from holdings like Qxx or Jxx, hoping partner has an honor.\nBad Leads to Avoid\nUnderleading an Ace: Never lead low from an Ace unless you also hold the King.\nLonely Ace: Avoid leading an Ace without the King, as it often gives declarer control.\nAway from a King: Leading low from Kxx may give away a trick unnecessarily.\nSingleton Trump: Avoid leading a single trump unless tactically necessary."
      }
    },
    {
      "id": "evDdWQYiybdQMDW4gEzw",
      "data": {
        "name": "Breaking and Bouncing",
        "text": "Breaking\n•\nThis action is used when the 1NT or 2NT opener holds a maximum hand, 4-card support for the transferred suit, and a working doubleton.\n•\nInstead of completing the transfer by bidding the transferred suit, the opener bids the suit where they hold the doubleton.\n•\nFor example, after a 1NT opening and a 2D transfer (showing hearts), the opener might bid 3C to show a doubleton in clubs.\n•\nIf the responder then returns to the transferred suit, this indicates a weak take-out hand.\n•\nWhen the opener has a 2NT bid, they should break to the suit where they hold their best outside values rather than necessarily a doubleton.\n•\nBreaking the transfer will not take the bidding past the three level sign-off and is a good competitive level to reach.\nBouncing\n•\nThis action is a competitive response to a transfer. The opener bids one level higher than usual in the auction.\n•\nBouncing shows high-quality 4-card support for the transferred suit, but not a hand good enough to break the transfer.\n•\nBouncing is used with a minimum 1NT opener or a hand that does not contain a working doubleton.\n•\nThe opener should bounce when their side is not vulnerable, and their values are concentrated in their long suit with aces and kings rather than queens or jacks.\n•\nThe opener should not bounce if they are vulnerable and the opponents are not, or their hand is 4-3-3-3 with poor quality trumps.\n•\nFor example, if the opening bid is 1NT and partner bids 2H (transferring to spades), and the opener has a minimum hand and good support in spades, they would bounce to 3S.\nWorking doubleton\n•\nA \"working doubleton\" is suitable for making ruffs. A small doubleton is ideal for a suit contract, and can be a worry for NTs.\n•\nDoubletons that contain a queen are likely to be more useful in a NT contract than a suit contract and are not good reasons to break a transfer.\nAdditional Notes\n•\nAny new suit introduced after a bounce or break is a cue-bid to investigate a possible slam.\n•\nThese responses were part of the original transfer convention, and top players would not play transfers without them.\n•\nPlaying transfers in response to a 1NT opener should be considered in response to other bids as well, including a 2NT opener, a 1NT overcall in direct and protective positions, a protective 2NT overcall, a 2NT overcall of a weak 2 bid, and a 2NT rebid after a 2C opener"
      }
    },
    {
      "id": "f8WoEfkI8zl2hlifd8KJ",
      "data": {
        "name": "Fit Jumps",
        "text": "●\nDefinition: A fit-jump occurs when a player jumps one level in a new suit after their partner has made an overcall. This bid shows support for partner's overcalled suit, along with a 5-card or longer suit headed by at least an ace or king. The point count for a fit-jump can vary from weak to strong, generally short of an opening hand.\n●\nPurpose: Fit-jumps help a partnership determine whether or not to sacrifice. It also helps partners judge the strength and distribution of their combined hands. By showing a double fit, the partnership can compete to higher levels with more confidence.\n●\nRequirements: When making a fit-jump, a player should have at least 3-card support for partner's overcalled suit. At higher levels, the player should also hold the right number of trumps according to the Total Trumps Principle (TTP), although this can be shaded by one if the player's own suit is of good quality. It is important to have values concentrated in the support for partner’s suit and in their own suit.\n●\nWhen They Occur: Fit-jumps occur below game level. Any jump in a new suit at the game level is natural, to play, and does not promise support for partner's suit.\n●\nFit-jumps in response to simple overcalls: Fit-jumps are used to show support for the overcaller's suit and a second suit with good honors.\n●\nFit-jumps in response to weak jump overcalls: Fit-jumps in response to weak jump overcalls operate similarly to those over simple overcalls. They promise 3-card support or better for partner’s suit and a good quality 5-card or longer suit.\n●\nSignificance: A fit-jump shows additional shape to a normal barrage raise. It is important to distinguish between a raise in the overcaller's suit, which is always weak, and a fit-jump, which shows values and confirms that the side holds the majority of points."
      }
    },
    {
      "id": "pZphsRtch5xxBDVpZqdL",
      "data": {
        "name": "Why \"24\" is an important number for the LTC",
        "text": "The number 24 in the Losing Trick Count (LTC) is a mathematical constant that represents the maximum possible number of losers in two hands (opener’s and responder’s combined). Here’s why:\nThe Logic Behind “24”\n1. Maximum Losers in a Single Hand:\n• Each hand can have up to 12 losers (3 losers per suit × 4 suits = 12).\n• This happens when a hand has no high honors (Ace, King, Queen) and no shortness (e.g., 3 small cards in each suit).\n2. Maximum Losers for Two Hands:\n• Since there are two hands in a partnership, the maximum combined number of losers is: \n3. Trick Calculation:\n• A standard bridge deal has 13 tricks available.\n• If you subtract the total losers from 24, you get the number of expected tricks for the partnership: \n• For example:\n• If the combined losers are 9, then $24 - 9 = 15$ expected tricks.\n• If the combined losers are 10, then $24 - 10 = 14$ expected tricks.\n4. Why “24” Works:\n• The LTC assumes that every loser corresponds to a trick lost to the opponents.\n• By subtracting the number of losers from 24, you estimate how many of the 13 available tricks your side will win.\nExample to Illustrate\nLet’s say Opener has 7 losers, and Responder has 8 losers.\n• Combined Losers = $7 + 8 = 15$.\n• Expected Tricks = $24 - 15 = 9$.\nThis suggests bidding to a level where your partnership can win around 9 tricks (e.g., bidding to 3♠ or 3♥).\nWhy It’s Useful\nThe constant “24” provides a simple and consistent way to evaluate trick potential based on losing tricks. It reflects the total possible losers across both hands and connects directly to the number of tricks available in a deal.\nIn summary, 24 is important because it represents the theoretical maximum number of losing tricks across two hands, and subtracting from it gives you an estimate of how many tricks your partnership can win!",
        "userId": "kmohX5w4bWVBxAAcKIbfrckLz8r2",
        "timestamp": {
          "_seconds": 1740911718,
          "_nanoseconds": 308000000
        }
      }
    },
    {
      "id": "pc7rTWq6Q6EGU2SbAHP7",
      "data": {
        "name": "5 Card Majors",
        "text": "The Five-Card Majors system requires that an opening bid of 1♥ or 1♠ guarantees at least five cards in the suit. This system is widely used in North America and many parts of Europe, though some regions prefer four-card majors.\n\nAdvantages\nEfficient Fit Discovery:\n5-3 fits are identified immediately, allowing for smoother bidding sequences.\nIf the responder has four-card support, a nine-card fit is instantly recognized, aiding in slam or competitive bidding.\nCompetitive Bidding:\nKnowing the opener has five cards in a major helps the responder make informed decisions in contested auctions.\nDeclarer Play Benefits:\nA 5-3 fit often provides an extra trump card for declarer, improving the chances of making additional tricks.\nSimplified Responses:\nResponder can raise with three-card support, knowing there’s an eight-card fit.\nDisadvantages\nDelayed 4-4 Fit Discovery:\n4-4 major fits are not immediately identified and may require further bidding rounds.\nOpponents’ overcalls can obscure these fits unless negative doubles are used effectively.\nWrong-Sided Contracts:\nSome contracts (e.g., notrump or 4-4 fits) may end up being played by the weaker hand, potentially exposing it to lead disadvantages.\nMinor Suit Openings:\nHands with no five-card major and a four-card minor require opening in a minor suit, which may be less informative and more vulnerable to preemption by opponents.\nLower Frequency of Immediate Fits:\nImmediate 5-3 fits occur less often than 4-4 fits, which can reduce the likelihood of certain advantageous auction sequences.\nResponder’s Dilemma with Weak Hands Opposite a Minor Opening:\nSince a 1♣ or 1♦ opening may be artificial (e.g., a short club or better minor), responder with fewer than 6 points may struggle to find a constructive bid.\nA 1♣ or 1♦ opening is forcing for one round because opener may have a three-card minor and the partnership may still have a 4-4 major fit.\nResponder can bid 1♥ or 1♠ with a four-card suit, but doing so with a very weak hand may create an unbalanced auction.\nSome partnerships use Transfer Walsh (see footnote) to keep opener as declarer and improve auction flexibility.\nAdditional Considerations\nThe system often pairs with a strong notrump opening.\nPartnerships must agree on conventions like “short club” openings to handle hands without a five-card major effectively.\nNegative doubles and Transfer Walsh responses can mitigate some disadvantages.\nFootnote: Transfer Walsh\nTransfer Walsh is a bidding convention used in Five-Card Major systems where responder transfers into a major suit after a 1♣ opening to improve declarer play and auction structure. For example:\n\n1♣ – 1♦ = Transfer to hearts (shows 4+ hearts).\n1♣ – 1♥ = Transfer to spades (shows 4+ spades).\nThis keeps the stronger hand (opener) as declarer, avoiding unnecessary notrump rebids from responder and improving slam exploration. It also helps responder with weak hands by allowing them to show a major without committing to a high-level contract."
      }
    },
    {
      "id": "qQfOjY55GVJEgareNEiL",
      "data": {
        "name": "4-4-4-1",
        "text": "When holding a 4-4-4-1 distribution in bridge, planning your opening bid and subsequent rebid is critical to accurately describe your hand. The key points to keep in mind are: Choose your opening suit carefully: With a singleton, your partner may bid it. Ensure you can make a suitable rebid that reflects your hand's strength without making an invalid or awkward reverse. Avoid reverses unless your hand is strong enough: "
      }
    },
    {
      "id": "uNOgG64SyuC8KNXsJ79Q",
      "data": {
        "name": "Cue Bidding",
        "text": "●\nPurpose: Cue bids are used when a suit has been agreed upon, and there is interest in investigating a slam. They are a definite slam try, not used merely to reach game.\n●\nMeaning: A cue bid shows the ace (sometimes a void) in the suit you name. You are able to show all your controls this way, other than in the trump suit. Bidding the agreed trump suit is a sign-off maneuver, indicating that you have no further controls to show or that you are not interested in continuing the slam search.\n●\nOrder of Showing Controls: It is generally best not to cue-bid a void initially, unless it will greatly benefit your side and you have enough trumps to ruff out your losers in that suit. The most sensible method combines bidding first the suit where you are more interested in your partner's second and third-round controls, and then choosing an order of cue bids that allows for the most bidding space. If you miss out a suit with your initial cue-bid, it does not deny a first-round control in that suit.\n●\nFirst and Second Round Controls: You check for first-round controls (aces) in all suits and then ask about second-round controls (kings). By the time you are asking about kings, you should be certain of a small slam and are investigating a grand slam. If you have an ace to spare, you are safe to cooperate in a cue-bidding sequence."
      }
    },
    {
      "id": "umfn9Kj56XFS9Wlprsqw",
      "data": {
        "name": "Reverse Bids",
        "text": "A reverse bid is a specific bidding sequence used to show additional strength and an unbalanced hand. It occurs when the opener bids a second suit at the two-level, and this new suit ranks higher than the first suit they bid. This sequence forces the responder to bid at a higher level to return to the opener’s first suit, indicating that the opener has extra values.\nKey Features of a Reverse Bid:\n1. Order of Suits: The opener’s second suit is of higher rank than their first suit (e.g., 1♦ followed by 2♥).\n2. Strength: A reverse typically shows 16-17+ high card points (HCP), though slightly fewer points may suffice with strong distributional hands.\n3. Distribution: The opener’s first suit is usually longer than the second suit, often with a 5-4 or 6-4 shape. Reverses are not made with suits of equal length (e.g., 5-5).\n4. Forcing Nature:\n• After a one-level response, a reverse by the opener is forcing for one round.\n• If the responder has bid at the two-level, the reverse is forcing to game.\n5. Responder’s Responsibility: The responder must bid again, even with a weak hand, as the reverse indicates that the partnership has sufficient strength to explore further.\nExamples of Reverse Bids:\n1. 1♦ – 1♠; 2♥\n• Opener shows 5+ diamonds, 4+ hearts, and at least 16-17 HCP.\n2. 1♣ – 1♥; 2♠\n• Opener shows 5+ clubs, 4+ spades, and additional strength.\n3. 1♦ – 1NT; 2♠\n• Opener indicates an unbalanced hand with extra strength and specific distribution.\nSituations That Are Not Reverses:\n• If the opener’s second bid does not force the responder to go to a higher level (e.g., 1♥ – 2♣; 2♦), it is not considered a reverse.\nPurpose of Reverse Bidding:\nThe reverse allows the opener to describe their hand’s strength and shape effectively without making a jump bid. It communicates that the hand is too strong for a simple rebid but does not warrant an immediate jump shift.\nThis principle is widely used in bidding systems like Standard American and Acol, though specific requirements may vary based on partnership agreements.\n"
      }
    }
  ],
  "rules": [
    {
      "id": "01weCep4hYxVpy8HC6g8",
      "data": {
        "name": "Revoke",
        "text": "A revoke in bridge occurs when a player fails to follow suit when able to do so. There are specific procedures for correcting a revoke, as well as penalties that may be applied.\nEstablishing a Revoke A revoke is considered established when any of the following occur:\n•\nThe revoking player or their partner makes a play to the next trick,\n•\nThe revoking player or their partner designates a card to be played in the next trick, or\n•\nThe revoking player or their partner makes a claim, concession, or agrees to a claim.\nCorrecting a Revoke A player must correct a revoke before it is established. To correct a revoke, the card played in error is withdrawn and a legal card is substituted. If a defender's card is withdrawn, it becomes a major penalty card. Each member of the non-offending side may withdraw a card they played after the revoke but before attention was drawn to it. The partner of the offender may also withdraw their card, but only if their RHO (right-hand opponent) does so. No card withdrawn by the non-offending side becomes a penalty card, but any card withdrawn by the offending side becomes a major penalty card.\nPenalties for a Revoke The penalty for a revoke depends on whether the revoke was made on trick 12, and whether the revoke card won the trick:\n•\nIf the revoke was not on trick 12 and the revoke card did not win the trick, the penalty is one trick transferred to the non-offending side.\n•\nIf the revoke card won the trick, the penalty is two tricks transferred to the non-offending side.\n•\nIf the revoke is on trick 12, it is corrected if discovered before the hands are returned to the board, but there is no penalty if the offender's partner had a choice of suits to play.\n•\nTricks are transferred at the end of the hand.\n•\nIf the revoke penalty is insufficient compensation for the non-offenders, then a director may adjust the score.\nSituations with No Penalty There are some situations where a revoke is established, but no penalty is applied:\n•\nThe offending side did not win the revoke trick or any subsequent tricks.\n•\nThe revoke is the second revoke by the same player for failing to play a card of the same suit.\n•\nThe revoke was in failing to play a card that was face-up (in Dummy's hand or otherwise).\n•\nAttention was first drawn to the revoke after the offending side made a call on the next hand or after the end of the round.\n•\nThe revoke occurred on the twelfth trick.\n•\nBoth sides have established revokes in the same hand.\nRevokes by Declarer or Dummy Declarers are subject to penalties for revoking just as defenders are. However, if Declarer revokes and Dummy wins the trick, Declarer is deemed to not have won that trick for the purposes of assessing a penalty. There is no automatic penalty for a revoke by Dummy. However, a director can adjust the score if the non-offending side is not sufficiently compensated.\nGeneral Notes\n•\nOnce a revoke is established, the revoke card cannot be withdrawn, and the trick stands as played.\n•\nThe non-offending side will never be worse off after a revoke, though they do not always have to end up better off.\n•\nAny player except dummy can ask any other player about a possible revoke. Dummy can only ask declarer. However, dummy and defenders are warned that asking could give unauthorised information.\n•\nIf a player is unable to lead or play as required to comply with a penalty, they may play any legal card"
      }
    },
    {
      "id": "5tKHthyJ7OeMGIdQsFDM",
      "data": {
        "name": "Insufficient Bid",
        "text": "An insufficient bid occurs when a player makes a call that is lower than the minimum legal bid. If an insufficient bid is made, the left-hand opponent (LHO) has the option to accept or not accept the bid.\nAccepting an insufficient bid:\n•\nIf the LHO accepts the insufficient bid, the bidding continues normally without penalty.\nNot accepting an insufficient bid:\n•\nIf the LHO does not accept the insufficient bid, the insufficient bid must be corrected to a legal call.\n•\nThe player who made the insufficient bid may correct it to the lowest sufficient bid that shows the same suit, suits, or a balanced hand, without penalty.\n•\nThe insufficient bid may be corrected to a comparable call, without penalty.\n◦\nA comparable call has the same or similar meaning as the withdrawn call.\n◦\nA comparable call defines a subset of possible meanings of the withdrawn call.\n◦\nA comparable call has the same purpose as the withdrawn call.\n•\nIf the insufficient bid cannot be corrected as above, the player must replace the insufficient bid with any sufficient bid or pass (not a double or redouble).\n◦\nPenalty: The offender's partner must pass throughout the remainder of the auction, and there may be lead penalties.\nExamples of insufficient bids and comparable calls:\n•\nIf the auction starts 2NT-P-2♦, where 2♦ is intended as a transfer but is insufficient, it can be corrected to 3♦ (transfer) without penalty, since both 2♦ and 3♦ show hearts.\n•\nIf the auction starts 2♣-2♠-2♦, where 2♦ is intended as a negative response but is insufficient, it may be corrected to a pass, which is a comparable call, without penalty, since both 2♦ and pass have a similar meaning.\n•\nAn opening pass out of turn shows a range of 0-11 points. If the next player doesn't accept it and the bidding reverts to the original player's partner who then opens 1♥, and the next hand passes, then if the original player now passes (0-5), bids 2♥ (5-9) or a natural 1NT (5-9), these are all comparable calls. However, if the original player bids 1♠, this is not a comparable call as it could be made on opening bid values.\n◦\nThe partner has additional information from the original pass that it is not a normal 1♠ response.\nAdditional Rules and Penalties:\n•\nA player may not correct an insufficient bid to a double or redouble unless it is a comparable call.\n•\nIf the insufficient bid is changed to another insufficient bid and the LHO does not condone either one, the penalty for not making a comparable call applies.\n•\nIf the insufficient bid is changed to a legal bid before the Director intervenes, the insufficient bid rules apply to the substituted legal bid.\n•\nIf the offending side reaches a better contract because of the insufficient bid, the director may award an adjusted score.\nLead penalties:\n•\nIf a withdrawn call is replaced by a comparable call, there are no lead penalties.\n•\nIf a withdrawn call is not replaced by a comparable call, then the declarer can forbid the lead of any one suit that was not specified in the legal auction by the offender for as long as the offender's partner retains the lead"
      }
    },
    {
      "id": "A5IxSWwDrECTsHGQweDR",
      "data": {
        "name": "Unauthorised Information",
        "text": "Authorised and Unauthorised Information in Bridge\nAuthorised Information\nPlayers may base their calls and plays on authorised information, which includes:\n\nCommunication Between Partners: Calls (bids, passes, doubles, redoubles) and plays.\nInformation Available Before Picking Up Cards:\nTheir system\nEstimated score\nEvaluation of opponents\nBoard details (dealer, vulnerability)\nInformation from Opponents: Hesitations, mannerisms, comments.\nUnauthorised Information (UI)\nUI refers to any information that should not influence decisions.\n\nSources of UI from a Partner:\nRemarks or questions\nAnswers to questions\nSpecial emphasis or tone of voice\nGestures, movements, or mannerisms\nHesitation (or undue haste) before calling\nOther Sources of UI:\nLooking at the wrong hand\nOverhearing calls, results, or remarks from other tables\nSeeing another player’s cards\nHandling Unauthorised Information\nIf a player receives UI from a source other than their partner, they must inform the Director. The Director may:\n\nAdjust positions\nRedeal the board (if no calls have been made and competition rules allow)\nAllow play to continue and later cancel the board if necessary\nCancel the board immediately\nIf UI comes from a partner, the player must:\n\nTake the only action that any reasonable player would take (if only one exists)\nConsider all logical alternatives and avoid any action suggested by the UI\nAvoid gaining an advantage from the UI\nCommon UI Example: Hesitation\nHesitation followed by a pass suggests the player would welcome a bid or double from their partner.\nHesitation followed by a double suggests the player might want their partner to remove the double.\nHesitation followed by a no-trump bid after agreeing on a suit suggests they might want their partner to return to the agreed suit.\nBreak in Tempo (BIT)\nA \"BIT\" occurs when a call is made out of tempo, including hesitations or undue haste.\n\nDirector’s Role in UI Cases\nIf the Director determines UI was present, they will:\n\nAsk to be recalled at the end of the hand if players are unhappy with the ruling.\nAssess whether the player possibly used the UI by considering:\nDid the player have a logical alternative? (An option that a significant number of similar-level players would consider, with some choosing it.)\nWas the chosen action suggested by the UI?\nIf both are true and the opponents were harmed, the Director should adjust the score.\n\nPlayer Rights\nA player may reserve their right to call the Director later if they suspect UI influenced an opponent.\nOpponents should call the Director immediately if they dispute a claim."
      }
    },
    {
      "id": "D8XI5X9ZGJIuMjCWkXR6",
      "data": {
        "name": "Alerting",
        "text": "When to Alert\n•\nMost artificial calls MUST be alerted.\n•\nCommon examples of calls that must be alerted are: Ghestem, Benjamin 2♣, Precision 1♣, Unusual no-trump, Asptro, and a pass that shows unexpected values.\n•\nAny call with a meaning that is so strange that opponents are not likely to consider it as a possibility should also be alerted.\n•\nExamples include: a Canapé bid, a raise from one to three as a pre-emptive raise over LHO’s pass, or as a forcing raise, a minimum response to a take-out double that shows values, a non-forcing change of suit response below game-level to a suit opening bid (except over a double or after Partner passed originally).\n•\nDoubles must be alerted if they are not for take-out or penalties, or if they have a totally unexpected meaning.\n•\nDo not alert doubles of 4♣ or higher, except for Lightner doubles.\n•\nWhen a player knows a call is alertable but cannot remember its meaning, they should alert.\nWhen Not to Alert\n•\nCalls that are announced do not need to be alerted.\n•\nCalls after the first round which are above 3NT do not need to be alerted.\n•\nThe following calls do not need to be alerted:\n◦\nA weak jump overcall\n◦\nA 5-card major opening bid\n◦\nA 3-card minor opening bid\n◦\nA non-forcing overcall where the suit may contain only four cards\n◦\nA natural response to an opening bid when a take-out double has intervened, whether forcing or non-forcing\n◦\nA natural opening bid of 4♥ or 4♠ when you also have a South African Texas 4♣ or 4♦ or similar artificial bid in your system\n◦\nA long-suit trial bid showing at least three cards in the suit bid\n◦\nA response of 2♣ to 1♠ that may be made on a 3-4-3-3 hand with four hearts.\n◦\nAn opening 2NT which is normally balanced, but may have a singleton\nConsequences of Failure to Alert\n•\nIf a player fails to alert a call, and the opponents were damaged as a result, the Director may award an adjusted score.\n•\nA player who claims to have been damaged because their opponents failed to alert a call, will not succeed in their claim if they were aware of its likely meaning, and had the opportunity to ask about it without putting their side’s interests at risk.\n•\nIf a player gives a mistaken explanation of their partner’s call, and it transpires that the original hand does not fall within that description, the opponents may be entitled to a remedy if they have been damaged.\n•\nIf a player realizes they have given a wrong explanation during the auction, they must call the Director at the end of the auction, or earlier if they prefer. During the play, they must call the Director immediately.\n◦\nThe last call made by the non-offending side may now be changed.\n◦\nThe director may re-open the auction.\n◦\nOtherwise, the Director will let play proceed, and awards an adjusted score if there was damage in consequence of the wrong explanation.\nGeneral Notes\n•\nPlayers should give a full explanation of their agreements, rather than using terms such as \"natural\" or \"standard\".\n•\nThe name of an agreement is rarely a conclusive disclosure of a call’s meaning and the opposition is entitled to a full explanation.\n•\nIf a player is unsure of the meaning of a call, they should refer their opponents to their system card, but should not say how they intend to interpret it.\n•\nPlayers should not guess what their partner’s call means, and should not say, “I take it to mean…”.\nIn summary, failing to alert a call can result in penalties if it misleads the opponents and they are damaged as a result. However, if the opponents knew the meaning of the call or had the opportunity to ask about it, the claim is not likely to succeed. It is crucial to alert artificial calls and any calls with unusual meanings, to give full explanations, and to avoid guessing or misinterpreting calls"
      }
    },
    {
      "id": "G21X347FpbjQYbXKm82t",
      "data": {
        "name": "When is a card \"played\" ",
        "text": "A card is considered played at different times depending on whether the player is a defender or declarer.\nFor a Defender: A card is deemed played when it is held in a way that makes it possible for their partner to see its face. It does not matter whether the partner actually saw the card, just that it was possible to see it.\nFor Declarer: A card is deemed played if it is face-up, touching or nearly touching the table, or held in a position that suggests it has been played. A card in Dummy is considered played if Declarer names it or deliberately touches it, unless it's for adjustment or to reach another card.\n•\nA face-down opening lead is not a played card until it is turned face up. However, once an opening lead is made, it can only be retracted with the consent of the Director, and only if there has been an irregularity.\n•\nIf a defender plays a card when it is their partner's turn to play, that card becomes a major penalty card.\n•\nWhen a player leads or plays multiple cards at once and only one is exposed, only that card is considered played. The other cards are picked up without penalty.\n•\nIf multiple cards are exposed at once, the player must choose which card they intend to play. If the player is a defender, the other exposed cards become either major or minor penalty cards."
      }
    },
    {
      "id": "NLF1R2lEB2UDmShIDF3c",
      "data": {
        "name": "Opening Lead Out of Turn",
        "text": "When a defender makes an opening lead out of turn, the director should inform the declarer that they have five options. The declarer can:\n•\nAccept the lead out of turn, and the partner puts their hand down as dummy, and the declarer plays as normal, beginning with their hand.\n•\nAccept the lead out of turn and permit their partner to play it, without conferring.\n•\nTreat the lead out of turn as a major penalty card; the correct leader may lead what they like, but their partner's card that was led out of turn must be played at the first legal opportunity.\n•\nRequire the correct leader to lead the suit of the card led out of turn; the card led out of turn is picked up, and the defender who led out of turn may play any legal card.\n•\nForbid the correct leader from leading the suit of the card led out of turn for as long as they retain the lead; the card led out of turn is picked up.\nIf the declarer chooses to treat the lead out of turn as a major penalty card, they will have further options if the offender's partner gains the lead while the penalty card is still on the table.\nIf either the declarer or dummy makes the opening lead, that card is picked up without penalty.\nIf the declarer begins to spread their hand in response to the opening lead out of turn and any of their cards are exposed, they must accept the lead, and their hand becomes dummy. If dummy begins to spread their hand in response to the opening lead out of turn and any of their cards are exposed, the declarer must accept the lead and play the hand themselves."
      }
    },
    {
      "id": "RGUlOF31xYB6IPR2bxN0",
      "data": {
        "name": "Bid out of turn",
        "text": "A bid out of turn occurs when a player makes a call when it is not their turn to do so. The rules and penalties depend on whose turn it was to call.\nGeneral Procedures for a Bid Out of Turn\n•\nThe left-hand opponent (LHO) can accept (or condone) a bid out of turn. If the LHO accepts the bid, the bidding continues normally and there is no penalty.\n•\nIf the LHO does not accept the bid, the bid out of turn is canceled, and the bidding reverts to the player whose turn it is to call.\nWhen it was the Right-Hand Opponent's (RHO) turn to call\n•\nIf the RHO passes, the bid out of turn must be repeated and bidding continues normally, with no penalty.\n•\nIf RHO bids, doubles, or redoubles, the offender may make any legal call.\n◦\nIf the call is a Comparable Call, there is no penalty, and the bidding continues normally. A comparable call has the same or similar meaning, defines a subset of the possible meanings, or has the same purpose as the withdrawn call.\n◦\nIf the call is not a Comparable Call, the offender's partner must pass when it is their next turn to call, and there may be lead penalties.\nWhen it was the Offender's Partner's turn to call\n•\nThe bid out of turn is canceled, and bidding reverts to the correct player.\n•\nThe offender's partner must treat the bid out of turn as unauthorized information.\n•\nThe offender may make any legal call.\n◦\nIf the call is a Comparable Call, there is no penalty, and the bidding continues normally.\n◦\nIf the call is not a Comparable Call, the offender's partner must pass when it is their next turn to call, and there may be lead penalties.\nComparable Calls\n•\nA comparable call is one that has the same or similar meaning as the withdrawn call, defines a subset of the possible meanings of the withdrawn call, or has the same purpose.\n•\nFor example, if a player passes out of turn, which shows 0-11 points, and after the bidding reverts to their partner, that partner opens 1♥, and the player then passes, or bids 2♥, or a natural 1NT, those are all considered comparable calls. However, bidding 1♠ would not be a comparable call as it could have been made on opening bid values.\nLead Penalties\n•\nLead penalties may be applied when a withdrawn call is not replaced by a comparable call.\n•\nIf the offender's partner gains the lead, the declarer may forbid the lead of any suit that was not specified in the legal auction by the offender.\nAdditional Notes\n•\nAn artificial pass (or a pass of partner's artificial call) out of rotation is treated as a bid out of rotation.\n•\nIf a call out of rotation is followed by a call from the player whose turn it was to call (and that player is an opponent), the original call out of rotation is canceled without penalty.\n•\nIf a call is followed by three passes, the auction does not end if one of those passes was out of rotation. The auction reverts to the player who missed their turn and all subsequent passes are canceled"
      }
    },
    {
      "id": "SSokSXbj6AMCgWkGCgym",
      "data": {
        "name": "Player not playing card",
        "text": "When a player does not play a card when required, it can result in different situations and penalties depending on the circumstances. Here's a breakdown based on the sources and our conversation history:\nFailure to Follow Suit (Revoke)\n•\nIf a player fails to play a card of the suit led when they have one, they have made a revoke.\n•\nA revoke becomes established when the offender or their partner makes any play to the next trick; designates a card to be played to the next trick; or makes a claim, concession, or agrees to a claim.\n•\nA player must correct a revoke before it becomes established. The revoke card is withdrawn and a legal card is substituted.\n•\nIf a defender withdraws their card to correct a revoke, it becomes a major penalty card.\n•\nPenalties for a revoke depend on the number of tricks the offending side won from the revoke trick onwards:\n◦\nIf the offending side won no tricks, there is no penalty.\n◦\nIf the offending side won one trick, one trick is transferred to the opponents.\n◦\nIf the offending side won two or more tricks, one trick is transferred to the opponents.\n◦\nIf the revoke card won the revoke trick, two tricks are transferred.\n•\nHowever, there are situations where there is no penalty for an established revoke:\n◦\nThe offending side won neither the revoke trick nor any subsequent trick.\n◦\nIt is the second revoke by the same player failing to play a card of the same suit.\n◦\nThe revoke was in failing to play a card that was face up on the table.\n◦\nAttention was drawn to the revoke after the offending side has called on the next hand or after the end of the round.\n◦\nThe revoke was on the twelfth trick.\n◦\nBoth sides have revoked on the same hand and both revokes are established.\nFailure to Play a Penalty Card\n•\nIf a defender fails to play a penalty card as required and instead plays another card, the declarer may:\n◦\nAccept the play, in which case the penalty card remains a penalty card.\n◦\nReject the card played and require the defender to substitute the penalty card. The rejected card becomes a major penalty card.\nInability to Lead or Play as Required\n•\nIf a player is unable to lead or play as required to comply with a penalty (e.g., they have no card of the required suit or are prohibited from leading a certain suit), they may play any legal card.\nIncomplete Trick (Defective Trick)\n•\nIf a trick is found to have too few cards before both sides have played to the next trick, the player who failed to play a card must play any legal card.\n•\nIf the trick has too few cards and this is discovered after both sides have played to the next trick:\n◦\nIf the player has at least one card of the suit led, then he chooses one to put in that trick, OR\n◦\nIf he has no card of the suit led, then he chooses any card to put in that trick.\n◦\nIn either case, they are deemed to have revoked on that trick and may be subject to a one-trick penalty.\nOther Scenarios\n•\nIf a player fails to play a card when they should have, and the result is that the player had a wrong number of cards in their hand, then:\n◦\nIf it is during or before the bidding, the card is restored to the deficient hand.\n◦\nIf it is during or after the play, if the card is found among the played cards, there is a defective trick. Otherwise, the card is returned to the deficient hand, and treated as though it had been there all along and the player may have revoked if they failed to play that card.\nIt is important to note that the Director should be called to resolve these situations and that the specific penalties and procedures vary depending on the exact circumstances"
      }
    },
    {
      "id": "V5MC6ekVWfSdVDM50k7n",
      "data": {
        "name": "Declarer calling for card from Dummy",
        "text": "When a declarer calls for a card from dummy, they should clearly state both the suit and the rank of the desired card. In the case of an incomplete or erroneous call, specific rules apply unless the declarer's intention is \"incontrovertibly otherwise\".\nHere are the rules for different types of incomplete designations:\n•\nIncomplete Designation of Rank:\n◦\nIf the declarer calls \"high\" or similar words, they are deemed to have called for the highest card.\n◦\nIf dummy is last to play, \"high\" may be deemed to call for the lowest winning card.\n◦\nIf the declarer directs dummy to \"win\" the trick, they are deemed to have called for the lowest winning card.\n◦\nIf the declarer calls \"low\" or similar words, they are deemed to have called for the lowest card.\n•\nDesignates Rank but not Suit:\n◦\nWhen leading, the declarer is deemed to have continued the suit in which dummy won the preceding trick, provided there is a card of the designated rank in that suit.\n◦\nIn other cases, the declarer must play the only card of that rank available.\n◦\nIf there are two or more such cards, the declarer must designate which they are to play.\n•\nDesignates Suit but not Rank:\n◦\nThe declarer is deemed to have called for the lowest card of the suit.\n•\nDesignates Neither Suit nor Rank:\n◦\nIf the declarer says \"Play anything\" or similar words, either defender may designate the card to be played from dummy.\n•\nErroneous call of a card not in Dummy:\n◦\nIf the declarer calls for a card that is not in dummy, the call is void and the declarer may designate any legal card"
      }
    },
    {
      "id": "aGDLC0QLk8iRholM4Liv",
      "data": {
        "name": "Bid out of turn",
        "text": "A bid out of turn occurs when a player makes a call when it is not their turn to do so. The rules and penalties depend on whose turn it was to call.\nGeneral Procedures for a Bid Out of Turn\n•\nThe left-hand opponent (LHO) can accept (or condone) a bid out of turn. If the LHO accepts the bid, the bidding continues normally and there is no penalty.\n•\nIf the LHO does not accept the bid, the bid out of turn is canceled, and the bidding reverts to the player whose turn it is to call.\nWhen it was the Right-Hand Opponent's (RHO) turn to call\n•\nIf the RHO passes, the bid out of turn must be repeated and bidding continues normally, with no penalty.\n•\nIf RHO bids, doubles, or redoubles, the offender may make any legal call.\n◦\nIf the call is a Comparable Call, there is no penalty, and the bidding continues normally. A comparable call has the same or similar meaning, defines a subset of the possible meanings, or has the same purpose as the withdrawn call.\n◦\nIf the call is not a Comparable Call, the offender's partner must pass when it is their next turn to call, and there may be lead penalties.\nWhen it was the Offender's Partner's turn to call\n•\nThe bid out of turn is canceled, and bidding reverts to the correct player.\n•\nThe offender's partner must treat the bid out of turn as unauthorized information.\n•\nThe offender may make any legal call.\n◦\nIf the call is a Comparable Call, there is no penalty, and the bidding continues normally.\n◦\nIf the call is not a Comparable Call, the offender's partner must pass when it is their next turn to call, and there may be lead penalties.\nComparable Calls\n•\nA comparable call is one that has the same or similar meaning as the withdrawn call, defines a subset of the possible meanings of the withdrawn call, or has the same purpose.\n•\nFor example, if a player passes out of turn, which shows 0-11 points, and after the bidding reverts to their partner, that partner opens 1♥, and the player then passes, or bids 2♥, or a natural 1NT, those are all considered comparable calls. However, bidding 1♠ would not be a comparable call as it could have been made on opening bid values.\nLead Penalties\n•\nLead penalties may be applied when a withdrawn call is not replaced by a comparable call.\n•\nIf the offender's partner gains the lead, the declarer may forbid the lead of any suit that was not specified in the legal auction by the offender.\nAdditional Notes\n•\nAn artificial pass (or a pass of partner's artificial call) out of rotation is treated as a bid out of rotation.\n•\nIf a call out of rotation is followed by a call from the player whose turn it was to call (and that player is an opponent), the original call out of rotation is canceled without penalty.\n•\nIf a call is followed by three passes, the auction does not end if one of those passes was out of rotation. The auction reverts to the player who missed their turn and all subsequent passes are canceled"
      }
    }
  ],
  "test": [
    {
      "id": "test",
      "data": {
        "message": "Hello from Firebase"
      }
    }
  ]
}